{
  "concepts": {
    "risk management": {
      "topic": "Risk management",
      "summary": "Risk management is the identification, evaluation, and prioritization of risks, followed by the minimization, monitoring, and control of the impact or probability of those risks occurring. Risks can come from various sources (i.e, threats) including uncertainty in international markets, political instability, dangers of project failures (at any phase in design, development, production, or sustaining of life-cycles), legal liabilities, credit risk, accidents, natural causes and disasters, deliberate attack from an adversary, or events of uncertain or unpredictable root-cause. Retail traders also apply risk management by using fixed percentage position sizing and risk-to-reward frameworks to avoid large drawdowns and support consistent decision-making under pressure.\nTwo types of events are analyzed in risk management: risks and opportunities. Negative events can be classified as risks while positive events are classified as opportunities.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Risk_management",
      "key_lessons": [
        "Risk management is the identification, evaluation, and prioritization of risks, followed by the minimization, monitoring, and control of the impact or probability of those risks occurring.",
        "Manage risk before seeking profit"
      ],
      "trading_application": "Use position sizing and stop losses",
      "learned_at": "2026-01-05T11:03:09.744367",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "slippage (finance)": {
      "topic": "Slippage (finance)",
      "summary": "With regard to futures contracts as well as other financial instruments, slippage is the difference between where the computer signaled the entry and exit for a trade and where actual clients, with actual money, entered and exited the market using the computer's signals. Market impact, liquidity, and frictional costs may also contribute.\nAlgorithmic trading is often used to reduce slippage, and algorithms can be backtested on past data to see the effects of slippage, but it is impossible to eliminate.\n\n\n== Measurement ==\n\n\n=== Using initial mid price ===\nNassim Nicholas Taleb (1997) defines slippage as the difference between the average execution price and the initial midpoint of the bid and the offer for a given quantity to be executed.\n\n\n=== Using initial execution price ===\nKnight and Satchell mention a flow trader needs to consider the effect of executing a large order on the market and to adjust the bid-ask spread accordingly.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Slippage_(finance)",
      "key_lessons": [
        "With regard to futures contracts as well as other financial instruments, slippage is the difference between where the computer signaled the entry and exit for a trade and where actual clients, with actual money, entered and exited the market using the computer's signals.",
        "Account for slippage in profit calculations"
      ],
      "trading_application": "Require higher expected profit for small-cap coins",
      "learned_at": "2026-01-05T11:03:30.205499",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "trading psychology": {
      "topic": "Trading psychology",
      "summary": "A stock trader or equity trader or share trader, also called a stock investor, is a person or company involved in trading equity securities and attempting to profit from the purchase and sale of those securities. Stock traders may be an investor, agent, hedger, arbitrageur, speculator, or stockbroker. Such equity trading in large publicly traded companies may be through a stock exchange. Stock shares in smaller public companies may be bought and sold in over-the-counter (OTC) markets or in some instances in equity crowdfunding platforms.\nStock traders can trade on their own account, called proprietary trading or self-directed trading, or through an agent authorized to buy and sell on the owner's behalf.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Stock_trader",
      "key_lessons": [
        "A stock trader or equity trader or share trader, also called a stock investor, is a person or company involved in trading equity securities and attempting to profit from the purchase and sale of those securities.",
        "Emotions can override logic - stay disciplined"
      ],
      "trading_application": "Wait for high-confidence setups only",
      "learned_at": "2026-01-05T11:03:31.451542",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "bid–ask spread": {
      "topic": "Bid–ask spread",
      "summary": "The bid–ask spread (also bid–offer or bid/ask and buy/sell in the case of a market maker) is the difference between the prices quoted (either by a single market maker or in a limit order book) for an immediate sale (ask) and an immediate purchase (bid) for stocks, futures contracts, options, or currency pairs in some auction scenario. The size of the bid–ask spread in a security is one measure of the liquidity of the market and of the size of the transaction cost. If the spread is 0 then it is a frictionless asset.\n\n\n== Liquidity ==\nThe trader initiating the transaction is said to demand liquidity, and the other party (counterparty) to the transaction supplies liquidity. Liquidity demanders place market orders and liquidity suppliers place limit orders.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Bid%E2%80%93ask_spread",
      "key_lessons": [
        "The bid–ask spread (also bid–offer or bid/ask and buy/sell in the case of a market maker) is the difference between the prices quoted (either by a single market maker or in a limit order book) for an immediate sale (ask) and an immediate purchase (bid) for stocks, futures contracts, options, or currency pairs in some auction scenario."
      ],
      "trading_application": "Account for bid-ask spread in profit calculations",
      "learned_at": "2026-01-05T11:03:32.850154",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "liquidity (economics)": {
      "topic": "Liquidity (economics)",
      "summary": "A liquidity trap is a situation, described in Keynesian economics, in which, \"after the rate of interest has fallen to a certain level, liquidity preference may become virtually absolute in the sense that almost everyone prefers holding cash rather than holding a debt (financial instrument) which yields so low a rate of interest.\"\nNegative natural interest rates and a zero lower bound are necessary conditions of a liquidity trap. Temporary economic disruption (e.g. banking crises, excessive debt accumulation) and structural factors (e.g. demographic decline, inequality) can produce negative natural interest rates. Credible monetary policy can overcome liquidity traps.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liquidity_trap",
      "key_lessons": [
        "A liquidity trap is a situation, described in Keynesian economics, in which, \"after the rate of interest has fallen to a certain level, liquidity preference may become virtually absolute in the sense that almost everyone prefers holding cash rather than holding a debt (financial instrument) which yields so low a rate of interest.",
        "Trade only in liquid markets"
      ],
      "trading_application": "Check order book depth before large trades",
      "learned_at": "2026-01-05T11:03:34.163797",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "gary leckey": {
      "topic": "Gary Leckey",
      "summary": "Gary Hill (1951) is an American artist whose work has centered on video, installation art, sculpture and performance. Based on works extending over fifty years from the late 1960s onward, he is considered a foundational figure in the areas of single- and multi-channel video and new-media art. Although his work has connections to conceptual art and minimalism, Hill is known for an independent approach that is inspired more by philosophical and literary texts than by central concerns of art and film such as representation, narrative and description. He has used an array of nascent technologies—computer software, projection, virtual reality, CGI—to examine consciousness and its relationship to the body, perception, time, and visual and verbal language. Los Angeles Times critic David Pagel commented, \"Hill creatively uses high-tech instruments to elicit personal experiences of archetypal simplicity. With his work, the invisible operations of thinking take tangible shape. Perception and cognition circle around one another, engaging their subjects.\"\nHill's work belongs to the public collections of the Centre Pompidou, Los Angeles County Museum of Art, Museum of Modern Art, Stedelijk Museum Amsterdam, Tate Gallery, and Whitney Museum, among others.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Gary_Hill",
      "key_lessons": [
        "Gary Hill (1951) is an American artist whose work has centered on video, installation art, sculpture and performance."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:28.061374",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "northern ireland": {
      "topic": "Northern Ireland",
      "summary": "Northern Ireland is a part of the United Kingdom in the north-east of the island of Ireland. It has been variously described as a country, province or region. Northern Ireland shares an open border to the south and west with the Republic of Ireland. At the 2021 census, its population was 1,903,175, making up around 3% of the UK's population and 27% of the population on the island of Ireland. The Northern Ireland Assembly, established by the Northern Ireland Act 1998, holds responsibility for a range of devolved policy matters, while other areas are reserved for the UK Government. The government of Northern Ireland cooperates with the government of Ireland in several areas under the terms of the Good Friday Agreement. The Republic of Ireland also has a consultative role on non-devolved governmental matters through the British–Irish Intergovernmental Conference.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Northern_Ireland",
      "key_lessons": [
        "Northern Ireland is a part of the United Kingdom in the north-east of the island of Ireland."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:30.057693",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "irish people": {
      "topic": "Irish people",
      "summary": "The Irish (Irish: Na Gaeil or Na hÉireannaigh) are an ethnic group and nation native to the island of Ireland, who share a common ancestry, history and culture. There have been humans in Ireland for about 33,000 years, and it has been continually inhabited for more than 10,000 years (see Prehistoric Ireland). For most of Ireland's recorded history, the Irish have been primarily a Gaelic people (see Gaelic Ireland). From the 9th century, small numbers of Vikings settled in Ireland, becoming the Norse–Gaels. Anglo-Normans also conquered parts of Ireland in the 12th century, while England's 16th/17th century conquest and colonisation of Ireland brought many English and Lowland Scots to parts of the island, especially the north. Today, Ireland is made up of the Republic of Ireland (officially called Ireland) and Northern Ireland (a part of the United Kingdom). The people of Northern Ireland hold various national identities including Irish, British or some combination thereof.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Irish_people",
      "key_lessons": [
        "The Irish (Irish: Na Gaeil or Na hÉireannaigh) are an ethnic group and nation native to the island of Ireland, who share a common ancestry, history and culture."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:32.106044",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "history of ireland": {
      "topic": "History of Ireland",
      "summary": "The first evidence of human presence in Ireland dates to around 34,000 years ago, with further findings dating the presence of Homo sapiens to 7,000 BC. The receding of the ice the Younger Dryas cold phase of the Quaternary, around 9700 BC, heralds the beginning of Prehistoric Ireland, which includes the archaeological periods known as the Mesolithic, the Neolithic from about 4000 BC, and the Copper Age beginning around 2500 BC with the arrival of the Beaker Culture. The Irish Bronze Age proper begins around 2000 BC and ends with the arrival of the Iron Age of the Celtic Hallstatt culture, beginning about 600 BC. The subsequent La Tène culture brought new styles and practices by 300 BC.\nGreek and Roman \nwriters give some information about Ireland during the Classical period (see \"protohistoric\" period), by which time the island may be termed \"Gaelic Ireland\". By the late 4th century CE Christianity had begun to gradually subsume or replace the earlier Celtic polytheism. By the end of the 6th century, it had introduced writing along with a predominantly monastic Celtic Christian church, profoundly altering Irish society.  Seafaring raiders and pirates from Scandinavia (later referred to as Vikings), settled from the late 8th century AD which resulted in extensive cultural interchange, as well as innovation in military and transport technology. Many of Ireland's towns were founded at this time as Scandinavian trading posts and coinage made its first appearance. Scandinavian penetration was limited and concentrated along coasts and rivers, and ceased to be a major threat to Gaelic culture after the Battle of Clontarf in 1014.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/History_of_Ireland",
      "key_lessons": [
        "The first evidence of human presence in Ireland dates to around 34,000 years ago, with further findings dating the presence of Homo sapiens to 7,000 BC."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:34.344885",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "irish culture": {
      "topic": "Irish culture",
      "summary": "The culture of Ireland includes the art, music, dance, folklore, theatre, traditional clothing, language, literature, cuisine and sport associated with Ireland and the Irish people. For most of its recorded history, the country’s culture has been primarily Gaelic (see Gaelic Ireland). Strong family values, wit and an appreciation for tradition are commonly associated with Irish culture.\nIrish culture has been greatly influenced by Christianity, most notably by the Roman Catholic Church, and religion plays a significant role in the lives of many Irish people. Today, there are often notable cultural differences between those of Catholic, Protestant and Orthodox background. References to God can be found in spoken Irish, notably exemplified by the Irish equivalent of “Hello” — “Dia dhuit” (literally: \"God be with you\").\nIrish culture has Celtic, Danish, Norwegian, Swedish, French and Spanish influences.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Culture_of_Ireland",
      "key_lessons": [
        "The culture of Ireland includes the art, music, dance, folklore, theatre, traditional clothing, language, literature, cuisine and sport associated with Ireland and the Irish people."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:36.325755",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "irish nationalism": {
      "topic": "Irish nationalism",
      "summary": "Irish nationalism is a nationalist political movement which, in its broadest sense, asserts that the people of Ireland should govern Ireland as a sovereign state. Since the mid-19th century, Irish nationalism has largely taken the form of cultural nationalism based on the principles of national self-determination and popular sovereignty. Irish nationalists during the 18th, 19th, and 20th centuries such as the United Irishmen in the 1790s, Young Irelanders in the 1840s, the Fenian Brotherhood during the 1880s, Fianna Fáil in the 1920s, and Sinn Féin styled themselves in various ways after French left-wing radicalism and republicanism. Irish nationalism celebrates the culture of Ireland, especially the Irish language, literature, music, and sports. It grew more potent during the period in which all of Ireland was part of the United Kingdom, which led to most of the island gaining independence from the UK in 1922.\nIrish nationalists believe that foreign English and later British rule in Ireland from the 1169 English Norman Invasion of Ireland onwards has been detrimental to Irish interests. At the time of the partition of Ireland most of the island was Roman Catholic and largely indigenous, while a sizeable portion of the country, particularly in the north, was Protestant and chiefly descended from people of Great Britain who colonised the land as settlers during the reign of King James I in 1609.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Irish_nationalism",
      "key_lessons": [
        "Irish nationalism is a nationalist political movement which, in its broadest sense, asserts that the people of Ireland should govern Ireland as a sovereign state."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:38.287768",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "irish republican army": {
      "topic": "Irish Republican Army",
      "summary": "The Irish Republican Army (IRA) is a name used by various resistance organisations in Ireland throughout the 20th and 21st centuries. Organisations by this name have been dominantly Catholic and dedicated to anti-imperialism through Irish republicanism, the belief that all of Ireland should be an independent republic free from British colonial rule.\nThe original Irish Republican Army (1919–1922), often now referred to as the \"old IRA\", was raised in 1919 from members of the Irish Volunteers and the Irish Citizen Army later reinforced by Irishmen formerly in the British Army in World War I, who returned to Ireland to fight against Britain in the Irish War of Independence. In Irish law, this IRA was the army of the revolutionary Irish Republic as declared by its parliament, Dáil Éireann, in 1919.\nIn the century that followed, the original IRA was reorganised, changed and split on multiple occasions, to such a degree that many subsequent paramilitary organisations have been known by that title – most notably the Provisional Irish Republican Army, which was a key participant during the Troubles in Northern Ireland. The contemporary IRA organisations each claim the sole right to the name, each insisting they are the original IRA's only legitimate descendant.\n\n\n== Overview of the IRAs ==\nThe playwright and former IRA member Brendan Behan once said that the first issue on any Irish organisation's agenda was \"the split\".",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Irish_Republican_Army",
      "key_lessons": [
        "should be an independent republic free from British colonial rule."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:40.354940",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "celtic christianity": {
      "topic": "Celtic Christianity",
      "summary": "Celtic Christianity is a form of Christianity that was common, or held to be common, across the Celtic-speaking world during the Early Middle Ages. The term Celtic Church is deprecated by many historians as it implies a unified and identifiable entity entirely separate from that of mainstream Western Christendom. For this reason, Brown (2003) notes a preference for the term Insular Christianity. As Patrick Wormald explained, \"One of the common misconceptions is that there was a Roman Church to which the Celtic Church was nationally opposed.\" \nSome writers have described a distinct \"Celtic Church\" uniting the Celtic peoples and distinguishing them from adherents of the Roman Church, while others classify Celtic Christianity as a set of distinctive practices occurring in those areas. Varying scholars reject the former notion, but note that there were certain traditions and practices present in both the Irish and British churches that were not seen in the wider Christian world.\nSuch practices include: a distinctive system for determining the dating of Easter, a style of monastic tonsure, a unique system of penance, and the popularity of going into \"exile for Christ\". Additionally, there were other practices that developed in certain parts of Great Britain and Ireland that were not known to have spread beyond particular regions.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Celtic_Christianity",
      "key_lessons": [
        "Celtic Christianity is a form of Christianity that was common, or held to be common, across the Celtic-speaking world during the Early Middle Ages."
      ],
      "trading_application": "Account for bid-ask spread in profit calculations",
      "learned_at": "2026-01-06T18:14:42.374360",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "irish mythology": {
      "topic": "Irish mythology",
      "summary": "Irish mythology is the body of myths indigenous to the island of Ireland. It was originally passed down orally in the prehistoric era. In the early medieval era, myths were written down by Christian scribes, who revised it considerably in order to fit the history and religion according to Christianized learning. Irish mythology is the best-preserved branch of Celtic mythology.\nThe myths are conventionally grouped into 'cycles'. The Mythological Cycle consists of tales and poems about the god-like Tuatha Dé Danann, who are based on Ireland's pagan deities, and other mythical races like the Fomorians. Important works in the cycle are the Lebor Gabála Érenn (\"Book of Invasions\"), a legendary history of Ireland, the Cath Maige Tuired (\"Battle of Moytura\"), and the Aided Chlainne Lir (\"Children of Lir\").",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Irish_mythology",
      "key_lessons": [
        "Irish mythology is the body of myths indigenous to the island of Ireland."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:44.300196",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "financial market": {
      "topic": "Financial market",
      "summary": "A financial market is a market in which people trade financial securities and derivatives at low transaction costs. Some of the securities include stocks and bonds, raw materials and precious metals, which are known in the financial markets as commodities.\nThe term \"market\" is sometimes used for what are more strictly exchanges, that is, organizations that facilitate the trade in financial securities, e.g., a stock exchange or commodity exchange. This may be a physical location (such as the New York Stock Exchange (NYSE), London Stock Exchange (LSE), Bombay Stock Exchange (BSE), or Johannesburg Stock Exchange (JSE Limited)), or an electronic system such as NASDAQ. Much trading of stocks takes place on an exchange; still, corporate actions (mergers, spinoffs) are outside an exchange, while any two companies or people, for whatever reason, may agree to sell the stock from the one to the other without using an exchange.\nTrading of currencies and bonds is largely on a bilateral basis, although some bonds trade on a stock exchange, and people are building electronic systems for these as well.\n\n\n== Types of financial markets ==\nWithin the financial sector, the term \"financial markets\" is often used to refer just to the markets that are used to raise finances. For long term finance, they are usually called the capital markets; for short term finance, they are usually called money markets.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Financial_market",
      "key_lessons": [
        "A financial market is a market in which people trade financial securities and derivatives at low transaction costs."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:46.278404",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "stock market": {
      "topic": "Stock market",
      "summary": "A stock market, equity market, or share market is the aggregation of buyers and sellers of stocks (also called shares), which represent ownership claims on businesses; these may include securities listed on a public stock exchange as well as stock that is only traded privately, such as shares of private companies that are sold to investors through equity crowdfunding platforms. Investments are usually made with an investment strategy in mind.\n\n\n== Size of the market ==\nThe total market capitalization of all publicly traded stocks worldwide rose from US$2.5 trillion in 1980 to US$111 trillion by the end of 2023.\nAs of 2016, there are 60 stock exchanges in the world. Of these, there are 16 exchanges with a market capitalization of $1 trillion or more, and they account for 87% of global market capitalization. Apart from the Australian Securities Exchange, these 16 exchanges are all in North America, Europe, or Asia.\nBy country, the largest stock markets as of January 2022 are in the United States of America (about 59.9%), followed by Japan (about 6.2%) and United Kingdom (about 3.9%).",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Stock_market",
      "key_lessons": [
        "A stock market, equity market, or share market is the aggregation of buyers and sellers of stocks (also called shares), which represent ownership claims on businesses; these may include securities listed on a public stock exchange as well as stock that is only traded privately, such as shares of private companies that are sold to investors through equity crowdfunding platforms."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:48.442440",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "cryptocurrency": {
      "topic": "Cryptocurrency",
      "summary": "A cryptocurrency (colloquially crypto) is a digital currency designed to work through a computer network that is not reliant on any central authority, such as a government or bank, to uphold or maintain it. However, a type of cryptocurrency called a stablecoin may rely upon government action or legislation to require that a stable value be upheld and maintained.\n\nIndividual coin ownership records are stored in a digital ledger or blockchain, which is a computerized database that uses a consensus mechanism to secure transaction records, control the creation of additional coins, and verify the transfer of coin ownership. The two most common consensus mechanisms are proof of work and proof of stake. Despite the name, which has come to describe many of the fungible blockchain tokens that have been created, cryptocurrencies are not considered to be currencies in the traditional sense, and varying legal treatments have been applied to them in various jurisdictions, including classification as commodities, securities, and currencies. Cryptocurrencies are generally viewed as a distinct asset class in practice.\nThe first cryptocurrency was bitcoin, which was first released as open-source software in 2009.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Cryptocurrency",
      "key_lessons": [
        "A cryptocurrency (colloquially crypto) is a digital currency designed to work through a computer network that is not reliant on any central authority, such as a government or bank, to uphold or maintain it."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:50.371877",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "foreign exchange market": {
      "topic": "Foreign exchange market",
      "summary": "The foreign exchange market (forex, FX, or currency market) is a global decentralized or over-the-counter (OTC) market for the trading of currencies. This market determines foreign exchange rates for every currency. By trading volume, it is by far the largest market in the world, followed by the credit market.\nThe main participants are the larger international banks. Financial centres function as anchors of trading between a range of multiple types of buyers and sellers around the clock, with the exception of weekends. As currencies are always traded in pairs, the market does not set a currency's absolute value, but rather determines its relative value by setting the market price of one currency if paid for with another. Example: 1 USD is worth 1.1 Euros or 1.2 Swiss Francs etc.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Foreign_exchange_market",
      "key_lessons": [
        "The foreign exchange market (forex, FX, or currency market) is a global decentralized or over-the-counter (OTC) market for the trading of currencies."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:14:52.378909",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "market maker": {
      "topic": "Market maker",
      "summary": "A market maker or liquidity provider is a company or an individual that quotes both a buy and a sell price in a tradable asset held in inventory, hoping to make a profit on the difference, which is called the bid–ask spread or turn. This stabilizes the market, reducing price variation (volatility) by setting a trading price range for the asset.\nIn U.S. markets, the U.S. Securities and Exchange Commission defines a \"market maker\" as a firm that stands ready to buy and sell stock on a regular and continuous basis at a publicly quoted price. A Designated Primary Market Maker (DPM) is a specialized market maker approved by an exchange to guarantee a buy or sell position in a particular assigned security, option, or option index.\n\n\n== In currency exchange ==\nMost foreign exchange trading firms are market makers, as are many banks. The foreign exchange market maker both buys foreign currency from clients and sells it to other clients. They derive income from the trading price differentials, helping the market by providing liquidity, reducing transaction costs, and facilitating trade.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Market_maker",
      "key_lessons": [
        "A market maker or liquidity provider is a company or an individual that quotes both a buy and a sell price in a tradable asset held in inventory, hoping to make a profit on the difference, which is called the bid–ask spread or turn."
      ],
      "trading_application": "Account for bid-ask spread in profit calculations",
      "learned_at": "2026-01-06T18:14:54.277604",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "arbitrage": {
      "topic": "Arbitrage",
      "summary": "Arbitrage ( , UK also ) is the practice of taking advantage of a difference in prices in two or more markets – striking a combination of matching deals to capitalize on the difference, the profit being the difference between the market prices at which the unit is traded. Arbitrage has the effect of causing prices of the same or very similar assets in different markets to converge.\nWhen used by academics in economics, an arbitrage is a transaction that involves no negative cash flow at any probabilistic or temporal state and a positive cash flow in at least one state; in simple terms, it is the possibility of a risk-free profit after transaction costs. For example, an arbitrage opportunity is present when there is the possibility to instantaneously buy something for a low price and sell it for a higher price.\nIn principle and in academic use, an arbitrage is risk-free; in common use, as in statistical arbitrage, it may refer to expected profit, though losses may occur, and in practice, there are always risks in arbitrage, some minor (such as fluctuation of prices decreasing profit margins), some major (such as devaluation of a currency or derivative). In academic use, an arbitrage involves taking advantage of differences in price of a single asset or identical cash-flows; in common use, it is also used to refer to differences between similar assets (relative value or convergence trades), as in merger arbitrage.\nThe term is mainly applied in the financial field.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Arbitrage",
      "key_lessons": [
        "Arbitrage ( , UK also ) is the practice of taking advantage of a difference in prices in two or more markets – striking a combination of matching deals to capitalize on the difference, the profit being the difference between the market prices at which the unit is traded."
      ],
      "trading_application": "Use position sizing and stop losses",
      "learned_at": "2026-01-06T18:14:56.133196",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "algorithmic trading": {
      "topic": "Algorithmic trading",
      "summary": "Algorithmic trading is a method of executing orders using automated pre-programmed trading instructions accounting for variables such as time, price, and volume. This type of trading attempts to leverage the speed and computational resources of computers relative to human traders. In the twenty-first century, algorithmic trading has been gaining traction with both retail and institutional traders. A study in 2019 showed that around 92% of trading in the Forex market was performed by trading algorithms rather than humans. \nIt is widely used by investment banks, pension funds, mutual funds, and hedge funds that may need to spread out the execution of a larger order or perform trades too fast for human traders to react to. However, it is also available to private traders using simple retail tools. Algorithmic trading is widely used in equities, futures, crypto and foreign exchange markets.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Algorithmic_trading",
      "key_lessons": [
        "Algorithmic trading is a method of executing orders using automated pre-programmed trading instructions accounting for variables such as time, price, and volume."
      ],
      "trading_application": "Account for bid-ask spread in profit calculations",
      "learned_at": "2026-01-06T18:14:58.079032",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "love": {
      "topic": "Love",
      "summary": "Love is an emotion involving strong attraction, affection, emotional attachment or concern for a person, animal, or thing. It is expressed in many forms, encompassing a range of strong and positive emotional and mental states, from the most sublime virtue, good habit, deepest interpersonal affection, to the simplest pleasure. An example of this range of meanings is that the love of a mother differs from the love of a spouse, which differs from the love of food.\nLove is considered to be both positive and negative, with its virtue representing kindness, compassion, and affection—\"the unselfish, loyal, and benevolent concern for the good of another\"—and its vice representing a moral flaw akin to vanity, selfishness, amour-propre, and egotism. It may also describe compassionate and affectionate actions towards other humans, oneself, or animals. In its various forms, love acts as a major facilitator of interpersonal relationships, and owing to its central psychological importance, is one of the most common themes in the creative arts. Love has been postulated to be a function that keeps human beings together against menaces and to facilitate the continuation of the species.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Love",
      "key_lessons": [
        "Love is an emotion involving strong attraction, affection, emotional attachment or concern for a person, animal, or thing."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:00.094826",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "unconditional love": {
      "topic": "Unconditional love",
      "summary": "Unconditional love is known as love without judgment. There are many ways of describing unconditional love, but most will agree that it is that type of love which has no bounds and is unchanging.\nIn Christianity, unconditional love is thought to be part of the Four Loves; affection, friendship, eros, and charity. In ethology, or the study of animal behavior, unconditional love would refer to altruism, which in turn refers to the behavior by individuals that increases the biological fitness of another while decreasing the fitness of the individual committing the act. In psychology, unconditional love refers to a state of mind in which one has the goal of increasing the welfare of another, despite the lack of any evidence of benefit for oneself.\n\n\n== Conditional love ==\n\nConditional love is based upon conditions or expectations of the recipient being met and satisfied.  It is in some ways, is a way for the lover to diminish the autonomy and relatedness necessary in creating or developing intrinsic motivation.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Unconditional_love",
      "key_lessons": [
        "increases the biological fitness of another while decreasing the fitness of the individual committing the act."
      ],
      "trading_application": "Wait for high-confidence setups only",
      "learned_at": "2026-01-06T18:15:02.029019",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "compassion": {
      "topic": "Compassion",
      "summary": "Compassion is a social emotion that motivates people to go out of their way to relieve the physical, mental, or emotional pains of others and themselves. Compassion is sensitivity to the emotional aspects of the suffering of others. When based on notions such as fairness, justice, and interdependence, it may be considered partially rational in nature.\nCompassion involves \"feeling for another\" and is a precursor to empathy, the \"feeling as another\" capacity (as opposed to sympathy, the \"feeling towards another\"). In common parlance, active compassion is the desire to alleviate another's suffering.\nCompassion involves allowing oneself to be moved by suffering to help alleviate and prevent it. An act of compassion is one that is intended to be helpful.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Compassion",
      "key_lessons": [
        "Compassion is a social emotion that motivates people to go out of their way to relieve the physical, mental, or emotional pains of others and themselves."
      ],
      "trading_application": "Calculate round-trip costs before trading",
      "learned_at": "2026-01-06T18:15:04.169163",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "empathy": {
      "topic": "Empathy",
      "summary": "Empathy is generally described as the ability to perceive another person's perspective, to understand, feel, and possibly share and respond to their experience. There are other (sometimes conflicting) definitions of empathy that include but are not limited to social, cognitive, and emotional processes primarily concerned with understanding others. Empathy is often considered to be a broad term, and can be divided into more specific concepts and categories, such as cognitive empathy, emotional (or affective) empathy, somatic empathy, and spiritual empathy.\nEmpathy is still a topic being studied. The major areas of research include the development of empathy, the genetics and neuroscience of empathy, cross-species empathy, and the impairment of empathy. Some researchers have attempted to quantify empathy through different methods, such as questionnaires that participants can fill out and then be scored on their answers.\nThe ability to imagine oneself as another person is a sophisticated process.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Empathy",
      "key_lessons": [
        "Empathy is generally described as the ability to perceive another person's perspective, to understand, feel, and possibly share and respond to their experience."
      ],
      "trading_application": "Calculate round-trip costs before trading",
      "learned_at": "2026-01-06T18:15:06.049144",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "human bonding": {
      "topic": "Human bonding",
      "summary": "Human bonding is the process of development of a close interpersonal relationship between two or more people. It most commonly takes place between family members or friends, but can also develop among groups, such as sporting teams and whenever people spend time together. Bonding is a mutual, interactive process, and is different from simple liking. It is the process of nurturing social connection.\nBonding typically refers to the process of attachment that develops between romantic or platonic partners, close friends, or parents and children. This bond is characterised by emotions such as affection and trust. Any two people who spend time together may form a bond.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Human_bonding",
      "key_lessons": [
        "Human bonding is the process of development of a close interpersonal relationship between two or more people."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:08.008702",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "altruism": {
      "topic": "Altruism",
      "summary": "Altruism is concern for the well-being, the life, of others, independently of personal benefit or reciprocity.\nThe word altruism was popularised (and possibly coined) by the French philosopher Auguste Comte (1798-1857) c. 1830 in French, as altruisme,\nas an antonym of egoism. He derived it from the Italian altrui, which in turn was derived from Latin alteri, meaning \"other people\" or \"somebody else\". Altruism may be considered a synonym of selflessness, the opposite of self-centeredness.\nAltruism is an important moral value in many cultures, ideologies, and religions. It can expand beyond care for humans to include consideration for other sentient beings and future generations.\n Altruism in biology, as observed in populations of organisms, is when an individual performs an action at a cost to itself (in terms of e.g.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Altruism",
      "key_lessons": [
        "Altruism is concern for the well-being, the life, of others, independently of personal benefit or reciprocity."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:09.876190",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "romantic love": {
      "topic": "Romantic love",
      "summary": "Romance or romantic love is a feeling of strong attraction toward another person, a mental state of \"being in love\" with courtship behaviors and focused attention on forming a relationship (or pair bond), and the practice of initiating relationships based on passionate feelings over more practical or ordinary concerns. Romantic love is considered to be a motivation or drive, which is distinct from (but related to) the concept of attachment.\nThe terms \"romance\" and \"romantic love\" are used with multiple definitions, which can be contradictory at times. The philosopher Arthur Lovejoy once wrote that \"The word 'romantic' has come to mean so many things that, by itself, it means nothing.\"\nCollins Dictionary defines romantic love as \"an intensity and idealization of a love relationship, in which the other is imbued with extraordinary virtue, beauty, etc., so that the relationship overrides all other considerations, including material ones.\" The concept of romantic love also came to represent the idea of individualistic choice in marriage and sexual partners, although it's rarely realized fully and can be a source of both gratification and disappointment in relationships.\nPeople who experience little to no romantic attraction are referred to as aromantic.\n\n\n== General definitions ==\nThe meaning of the term \"romantic love\" has changed considerably throughout history, making it difficult to easily define without examining its cultural origins. The term is used with multiple definitions by academics.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Romance",
      "key_lessons": [
        "Romance or romantic love is a feeling of strong attraction toward another person, a mental state of \"being in love\" with courtship behaviors and focused attention on forming a relationship (or pair bond), and the practice of initiating relationships based on passionate feelings over more practical or ordinary concerns."
      ],
      "trading_application": "Calculate round-trip costs before trading",
      "learned_at": "2026-01-06T18:15:11.852641",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "meaning of life": {
      "topic": "Meaning of life",
      "summary": "The meaning of life is the concept of an individual's life, human life, or existence in general having an inherent significance or a philosophical point. There is no consensus on the specifics of such a concept, or whether the concept itself even exists in any objective sense. Thinking and discourse on the topic is sought in the English language through questions such as—but not limited to—\"What is the meaning of life?\", \"What is the purpose of existence?\", and \"Why are we here?\". There have been many proposed answers to these questions from many different cultural and ideological backgrounds. The search for life's meaning has produced much philosophical, scientific, theological, and metaphysical speculation throughout history. Different people and cultures believe different things for the answer to this question. Opinions vary on the usefulness of using time and resources in the pursuit of an answer.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Meaning_of_life",
      "key_lessons": [
        "The meaning of life is the concept of an individual's life, human life, or existence in general having an inherent significance or a philosophical point."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:13.986423",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "existentialism": {
      "topic": "Existentialism",
      "summary": "Existentialism is a family of philosophical views and inquiry that explore the human individual's struggle to lead an authentic life despite the apparent absurdity or incomprehensibility of existence. In examining meaning, purpose, and value, existentialist thought often includes concepts such as existential crises, angst, courage, and freedom.\nExistentialism is associated with several 19th- and 20th-century European philosophers who shared an emphasis on the human subject, despite often profound differences in thought. Among the 19th-century figures now associated with existentialism are philosophers Søren Kierkegaard and Friedrich Nietzsche, as well as novelist Fyodor Dostoevsky, all of whom critiqued rationalism and concerned themselves with the problem of meaning. The word existentialism, however, was not coined until the mid 20th century, during which it became most associated with contemporaneous philosophers Jean-Paul Sartre, Martin Heidegger, Simone de Beauvoir, Karl Jaspers, Gabriel Marcel, Paul Tillich, and more controversially Albert Camus. \nMany existentialists considered traditional systematic or academic philosophies, in style and content, to be too abstract and removed from concrete human experience. A primary virtue in existentialist thought is authenticity.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Existentialism",
      "key_lessons": [
        "Existentialism is a family of philosophical views and inquiry that explore the human individual's struggle to lead an authentic life despite the apparent absurdity or incomprehensibility of existence."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:15.874859",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "humanism": {
      "topic": "Humanism",
      "summary": "Humanism is a philosophical stance that emphasizes the individual and social potential, and agency of human beings, whom it considers the starting point for serious moral and philosophical inquiry.\nThe meaning of the term \"humanism\" has changed according to successive intellectual movements that have identified with it. During the Italian Renaissance, Italian scholars inspired by Greek classical scholarship gave rise to the Renaissance humanism movement. During the Age of Enlightenment, humanistic values were reinforced by advances in science and technology, giving confidence to humans in their exploration of the world. By the early 20th century, organizations dedicated to humanism flourished in Europe and the United States, and have since expanded worldwide. In the early 21st century, the term generally denotes a focus on human well-being and advocates for human freedom, happiness, autonomy, and progress. It views humanity as responsible for the promotion and development of individuals, espouses the equal and inherent dignity of all human beings, and emphasizes a concern for humans in relation to the world.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Humanism",
      "key_lessons": [
        "Humanism is a philosophical stance that emphasizes the individual and social potential, and agency of human beings, whom it considers the starting point for serious moral and philosophical inquiry."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:17.766789",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    },
    "liberation": {
      "topic": "Liberation",
      "summary": "Liberation (Russian: Освобождение, translit. Osvobozhdenie, German: Befreiung, Polish: Wyzwolenie) is a film series released in 1970 and 1971, directed by Yuri Ozerov and shot in wide-format NIKFI process (70 mm). The script was written by Yuri Bondarev and Oscar Kurganov. The series was a Soviet-Polish-East German-Italian-Yugoslav co-production.\nThe films are a dramatized account of the liberation of the Soviet Union's territory and the subsequent defeat of Nazi Germany in the Great Patriotic War, focusing on five major Eastern Front campaigns: the Battle of Kursk, the Lower Dnieper Offensive, Operation Bagration, the Vistula–Oder Offensive, and the Battle of Berlin.\n\n\n== Plot ==\n\n\n=== Film I: The Fire Bulge ===\nAfter the Soviets are alerted to the imminent German offensive in Kursk, they launch a preemptive artillery strike, delaying the enemy. The battalion of Lieutenant Colonel Lukin – led by officers Tzvetaev, Orlov, and Maximov – participates in the battle, as well as the tank of Lieutenant Vasiliev.",
      "source": "Wikipedia",
      "source_url": "https://en.wikipedia.org/wiki/Liberation_(film_series)",
      "key_lessons": [
        "Liberation (Russian: Освобождение, translit."
      ],
      "trading_application": "Apply learned knowledge to improve decision making",
      "learned_at": "2026-01-06T18:15:20.852200",
      "confidence": 1.0,
      "times_applied": 0,
      "success_rate": 0.0
    }
  },
  "rules": {
    "RISK_001": {
      "rule_id": "RISK_001",
      "description": "Never risk more than 2% on a single trade",
      "source_concept": "risk_management",
      "condition": "before_any_trade",
      "action": "check_position_size_vs_portfolio",
      "priority": 100,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "SLIP_001": {
      "rule_id": "SLIP_001",
      "description": "Require profit > 3x expected slippage",
      "source_concept": "slippage",
      "condition": "evaluating_opportunity",
      "action": "reject_if_profit_too_small",
      "priority": 95,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "FEES_001": {
      "rule_id": "FEES_001",
      "description": "Total fees must be < 30% of expected profit",
      "source_concept": "fees",
      "condition": "evaluating_opportunity",
      "action": "calculate_fee_impact",
      "priority": 90,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "LIQ_001": {
      "rule_id": "LIQ_001",
      "description": "Check liquidity before trading",
      "source_concept": "market_structure",
      "condition": "before_any_trade",
      "action": "verify_sufficient_liquidity",
      "priority": 85,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "PSYCH_001": {
      "rule_id": "PSYCH_001",
      "description": "Wait for high confidence before trading",
      "source_concept": "psychology",
      "condition": "confidence_check",
      "action": "require_80_percent_confidence",
      "priority": 80,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "LOSS_001": {
      "rule_id": "LOSS_001",
      "description": "Block path after first loss (learn from mistakes)",
      "source_concept": "risk_management",
      "condition": "after_loss",
      "action": "block_losing_path",
      "priority": 100,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIN_001": {
      "rule_id": "WIN_001",
      "description": "Increase confidence on winning paths",
      "source_concept": "psychology",
      "condition": "after_win",
      "action": "boost_path_confidence",
      "priority": 75,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_78EC87E6": {
      "rule_id": "WIKI_78EC87E6",
      "description": "Apply Risk management knowledge",
      "source_concept": "Risk management",
      "condition": "trading_decision",
      "action": "Use position sizing and stop losses",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_33D41AF7": {
      "rule_id": "WIKI_33D41AF7",
      "description": "Apply Slippage (finance) knowledge",
      "source_concept": "Slippage (finance)",
      "condition": "trading_decision",
      "action": "Require higher expected profit for small-cap coins",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_654D1633": {
      "rule_id": "WIKI_654D1633",
      "description": "Apply Trading psychology knowledge",
      "source_concept": "Trading psychology",
      "condition": "trading_decision",
      "action": "Wait for high-confidence setups only",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_92DDF0BA": {
      "rule_id": "WIKI_92DDF0BA",
      "description": "Apply Bid–ask spread knowledge",
      "source_concept": "Bid–ask spread",
      "condition": "trading_decision",
      "action": "Account for bid-ask spread in profit calculations",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_3066BDD6": {
      "rule_id": "WIKI_3066BDD6",
      "description": "Apply Liquidity (economics) knowledge",
      "source_concept": "Liquidity (economics)",
      "condition": "trading_decision",
      "action": "Check order book depth before large trades",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_4866AA68": {
      "rule_id": "WIKI_4866AA68",
      "description": "Apply Gary Leckey knowledge",
      "source_concept": "Gary Leckey",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_48A97757": {
      "rule_id": "WIKI_48A97757",
      "description": "Apply Northern Ireland knowledge",
      "source_concept": "Northern Ireland",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_D8DF0E03": {
      "rule_id": "WIKI_D8DF0E03",
      "description": "Apply Irish people knowledge",
      "source_concept": "Irish people",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_E969C942": {
      "rule_id": "WIKI_E969C942",
      "description": "Apply History of Ireland knowledge",
      "source_concept": "History of Ireland",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_9C2A2DFE": {
      "rule_id": "WIKI_9C2A2DFE",
      "description": "Apply Irish culture knowledge",
      "source_concept": "Irish culture",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_5F24094A": {
      "rule_id": "WIKI_5F24094A",
      "description": "Apply Irish nationalism knowledge",
      "source_concept": "Irish nationalism",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_FE8D16EC": {
      "rule_id": "WIKI_FE8D16EC",
      "description": "Apply Irish Republican Army knowledge",
      "source_concept": "Irish Republican Army",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_79C82EF2": {
      "rule_id": "WIKI_79C82EF2",
      "description": "Apply Celtic Christianity knowledge",
      "source_concept": "Celtic Christianity",
      "condition": "trading_decision",
      "action": "Account for bid-ask spread in profit calculations",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_3BACAFCF": {
      "rule_id": "WIKI_3BACAFCF",
      "description": "Apply Irish mythology knowledge",
      "source_concept": "Irish mythology",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_39608964": {
      "rule_id": "WIKI_39608964",
      "description": "Apply Financial market knowledge",
      "source_concept": "Financial market",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_1E19B3E5": {
      "rule_id": "WIKI_1E19B3E5",
      "description": "Apply Stock market knowledge",
      "source_concept": "Stock market",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_4C11904E": {
      "rule_id": "WIKI_4C11904E",
      "description": "Apply Cryptocurrency knowledge",
      "source_concept": "Cryptocurrency",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_7A162384": {
      "rule_id": "WIKI_7A162384",
      "description": "Apply Foreign exchange market knowledge",
      "source_concept": "Foreign exchange market",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_50602E1C": {
      "rule_id": "WIKI_50602E1C",
      "description": "Apply Market maker knowledge",
      "source_concept": "Market maker",
      "condition": "trading_decision",
      "action": "Account for bid-ask spread in profit calculations",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_C6F2057A": {
      "rule_id": "WIKI_C6F2057A",
      "description": "Apply Arbitrage knowledge",
      "source_concept": "Arbitrage",
      "condition": "trading_decision",
      "action": "Use position sizing and stop losses",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_416CD934": {
      "rule_id": "WIKI_416CD934",
      "description": "Apply Algorithmic trading knowledge",
      "source_concept": "Algorithmic trading",
      "condition": "trading_decision",
      "action": "Account for bid-ask spread in profit calculations",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_8BD7A115": {
      "rule_id": "WIKI_8BD7A115",
      "description": "Apply Love knowledge",
      "source_concept": "Love",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_82474B95": {
      "rule_id": "WIKI_82474B95",
      "description": "Apply Unconditional love knowledge",
      "source_concept": "Unconditional love",
      "condition": "trading_decision",
      "action": "Wait for high-confidence setups only",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_CA9D227F": {
      "rule_id": "WIKI_CA9D227F",
      "description": "Apply Compassion knowledge",
      "source_concept": "Compassion",
      "condition": "trading_decision",
      "action": "Calculate round-trip costs before trading",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_34D8802F": {
      "rule_id": "WIKI_34D8802F",
      "description": "Apply Empathy knowledge",
      "source_concept": "Empathy",
      "condition": "trading_decision",
      "action": "Calculate round-trip costs before trading",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_9EFAF29D": {
      "rule_id": "WIKI_9EFAF29D",
      "description": "Apply Human bonding knowledge",
      "source_concept": "Human bonding",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_A74D3162": {
      "rule_id": "WIKI_A74D3162",
      "description": "Apply Altruism knowledge",
      "source_concept": "Altruism",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_69ABB6F2": {
      "rule_id": "WIKI_69ABB6F2",
      "description": "Apply Romantic love knowledge",
      "source_concept": "Romantic love",
      "condition": "trading_decision",
      "action": "Calculate round-trip costs before trading",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_82529D30": {
      "rule_id": "WIKI_82529D30",
      "description": "Apply Meaning of life knowledge",
      "source_concept": "Meaning of life",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_8038A866": {
      "rule_id": "WIKI_8038A866",
      "description": "Apply Existentialism knowledge",
      "source_concept": "Existentialism",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_192F9DD5": {
      "rule_id": "WIKI_192F9DD5",
      "description": "Apply Humanism knowledge",
      "source_concept": "Humanism",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    },
    "WIKI_A6E89BF7": {
      "rule_id": "WIKI_A6E89BF7",
      "description": "Apply Liberation knowledge",
      "source_concept": "Liberation",
      "condition": "trading_decision",
      "action": "Apply learned knowledge to improve decision making",
      "priority": 50,
      "active": true,
      "applications": 0,
      "successes": 0
    }
  },
  "stats": {
    "wikipedia_queries": 59,
    "api_queries": 0,
    "concepts_learned": 59,
    "rules_derived": 32,
    "knowledge_applications": 0
  },
  "last_saved": "2026-01-06T18:15:20.852524"
}