{
  "tactics": {
    "b975165b": {
      "tactic_id": "b975165b",
      "name": "Guerrilla warfare",
      "source": "IRA_GUERRILLA",
      "description": "Guerrilla warfare is a type of unconventional warfare in which small groups of irregular military, such as  rebels, partisans, paramilitary personnel or armed civilians, which may include children in the military, use ambushes, sabotage, terrorism, raids, petty warfare or hit-and-run tactics in a rebellion, in a violent conflict, in a war or in a civil war to fight against regular military, police or rival insurgent forces.\nAlthough the term \"guerrilla warfare\" was coined in the context of the P",
      "trading_application": "Small, quick trades. Hit profitable opportunities fast, exit before losses accumulate.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:54:57.591637",
      "last_applied": ""
    },
    "ad97150b": {
      "tactic_id": "ad97150b",
      "name": "Irish Republican Army",
      "source": "IRA_GUERRILLA",
      "description": "The Irish Republican Army (IRA) is a name used by various resistance organisations in Ireland throughout the 20th and 21st centuries. Organisations by this name have been dominantly Catholic and dedicated to anti-imperialism through Irish republicanism, the belief that all of Ireland should be an independent republic free from British colonial rule.\nThe original Irish Republican Army (1919–1922), often now referred to as the \"old IRA\", was raised in 1919 from members of the Irish Volunteers and ",
      "trading_application": "Hit and run tactics. Quick trades, don't overstay welcome.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:54:59.705257",
      "last_applied": ""
    },
    "db2d5a2f": {
      "tactic_id": "db2d5a2f",
      "name": "Asymmetric warfare",
      "source": "IRA_GUERRILLA",
      "description": "Asymmetric warfare (or asymmetric engagement) is a type of war between belligerents whose relative military power, strategy or tactics differ significantly. This type of warfare often involves insurgents, terrorist groups, or resistance militias operating within territory mostly controlled by the superior force.\nAsymmetrical warfare can also describe a conflict in which belligerents' material resources are uneven, and consequently, each may attempt to exploit each other's relative weaknesses. Su",
      "trading_application": "Risk small amounts for larger potential gains. Never risk more than you can afford to lose.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:55:01.834648",
      "last_applied": ""
    },
    "7b51face": {
      "tactic_id": "7b51face",
      "name": "Hit-and-run tactics",
      "source": "IRA_GUERRILLA",
      "description": "Hit-and-run tactics are a tactical doctrine of using short surprise attacks, withdrawing before the enemy can respond in force, and constantly maneuvering to avoid full engagement with the enemy. The purpose is not to decisively defeat the enemy or capture territory but to weaken enemy forces over time through raids, harassment, and skirmishing and limiting risk to friendly forces. Such tactics can also expose enemy defensive weaknesses and achieve a psychological effect on the enemy's morale.\nH",
      "trading_application": "Small, quick trades. Hit profitable opportunities fast, exit before losses accumulate.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:55:04.307537",
      "last_applied": ""
    },
    "c5d8c916": {
      "tactic_id": "c5d8c916",
      "name": "Ambush",
      "source": "IRA_GUERRILLA",
      "description": "An ambush is a surprise attack carried out by combatants waiting in a concealed (and typically well-defiladed) position against an approaching enemy individual or group. The concealed position itself or the concealed person(s) may also be called an \"ambush\", and the chosen area to carry out the ambush is known as the kill zone or the trap.\nThe term \"ambush\" is also used in animal behavior studies to describe the predation strategy of some carnivores using stealth and deception (i.e. ambush preda",
      "trading_application": "Wait patiently for perfect setups. Let the opportunity come to you.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:55:07.628709",
      "last_applied": ""
    },
    "26034109": {
      "tactic_id": "26034109",
      "name": "Covert operation",
      "source": "IRA_GUERRILLA",
      "description": "A covert operation, clandestine operation or undercover operation is a military or police operation involving a covert agent or troops acting under an assumed cover to conceal the identity of the party responsible.\n\n\n== US law ==\nUnder US law, the Central Intelligence Agency (CIA) must lead covert operations unless the president finds that another agency should do so and informs Congress. The CIA's authority to conduct covert action comes from the National Security Act of 1947. President Ronald ",
      "trading_application": "Trade quietly in liquid markets. Avoid moving the price against yourself.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-20T19:55:10.627479",
      "last_applied": ""
    },
    "9717d57e": {
      "tactic_id": "9717d57e",
      "name": "Sun Tzu",
      "source": "WAR_PSYCHOLOGY",
      "description": "Sun Tzu (;traditional Chinese: 孫子; simplified Chinese: 孙子; pinyin: Sūnzǐ) was a Chinese military general, strategist, philosopher, and writer who lived during the Eastern Zhou period (771–256 BC). Sun Tzu is traditionally credited as the author of The Art of War, a Classical Chinese text on military strategy from the Warring States period, though the earliest parts of the work probably date to at least a century after him.\nSun Tzu is revered in Chinese and East Asian culture as a legendary histo",
      "trading_application": "Know yourself and the market. Trade only when conditions favor you.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:07.882574",
      "last_applied": ""
    },
    "6f5d2032": {
      "tactic_id": "6f5d2032",
      "name": "The Art of War",
      "source": "WAR_PSYCHOLOGY",
      "description": "The Art of War is an ancient Chinese military treatise dating from the late Spring and Autumn period (roughly 5th century BCE). The work, which is attributed to the ancient Chinese military strategist Sun Tzu (\"Master Sun\"), is composed of 13 chapters. Each chapter is devoted to a different set of skills or arts related to warfare, finance and how they apply to military strategy and tactics. For almost 1,500 years, it was the lead text in an anthology that was formalized as the Seven Military Cl",
      "trading_application": "Know yourself and the market. Trade only when conditions favor you.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:09.541691",
      "last_applied": ""
    },
    "49fc004d": {
      "tactic_id": "49fc004d",
      "name": "Tactical patience",
      "source": "WAR_PSYCHOLOGY",
      "description": "Miguel Di Pizio (Italian: [miˈɡuɛl di ˈpit.tsjo]; born 4 January 2006) is an Australian professional soccer player who plays as an attacking midfielder for A-League Men club Central Coast Mariners.\n\n\n== Early life ==\nBorn in Sydney, New South Wales, Di Pizio started playing football at the age of four. He attended Mamre Anglican School, located in Kemps Creek, and Westfields Sports High School, representing in both schools' football teams. He has an older brother, Gianni Di Pizio, who also playe",
      "trading_application": "The patient trader profits. Wait for high-probability setups only.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:11.716293",
      "last_applied": ""
    },
    "953b77bf": {
      "tactic_id": "953b77bf",
      "name": "Strategic retreat",
      "source": "WAR_PSYCHOLOGY",
      "description": "Major General Nathanael Greene (August 7, 1742 – June 19, 1786) was an American military officer and planter who served in the Continental Army during the Revolutionary War. He emerged from the war with a reputation as one of George Washington's most talented and dependable officers and is known for his successful command in the Southern theater of the conflict.\nBorn into a prosperous Quaker family in Warwick, Rhode Island, Greene became active in the colonial opposition to British revenue polic",
      "trading_application": "Strategic retreat is not defeat. Cut losses early to fight another day.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:13.020646",
      "last_applied": ""
    },
    "aa582343": {
      "tactic_id": "aa582343",
      "name": "Deception",
      "source": "WAR_PSYCHOLOGY",
      "description": "Deception is the act of convincing of one or many recipients of untrue information. The person creating the deception knows it to be false while the receiver of the information does not. It is often done for personal gain or advantage.\nDeceit and dishonesty can also form grounds for civil litigation in tort, or contract law (where it is known as misrepresentation or fraudulent misrepresentation if deliberate), or give rise to criminal prosecution for fraud.\n\n\n== Types ==\n\n\n=== Communication ===\n",
      "trading_application": "Markets deceive. False breakouts, fake news, manipulation. Stay skeptical.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:14.329951",
      "last_applied": ""
    },
    "9acb73ce": {
      "tactic_id": "9acb73ce",
      "name": "Misdirection",
      "source": "WAR_PSYCHOLOGY",
      "description": "In theatrical magic, misdirection is a form of deception in which the performer draws audience attention to one thing to distract it from another. Managing audience attention is the aim of all theater, and the foremost requirement of all magic acts. Whether the magic is of a \"pocket trick\" variety or a large stage production, misdirection is the central secret. The term describes either the effect (the observer's focus on an unimportant object) or the sleight of hand or patter (the magician's sp",
      "trading_application": "Markets deceive. False breakouts, fake news, manipulation. Stay skeptical.",
      "times_applied": 0,
      "success_rate": 0.0,
      "total_saved": 0.0,
      "learned_at": "2026-01-16T00:24:16.477142",
      "last_applied": ""
    }
  },
  "last_saved": "2026-01-20T19:55:23.072863"
}